[
    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.postimg.cc/ZqLNq078/1.png",
        "review": "The Great Gatsby is a timeless classic that delves into the complexities of the American Dream and the allure of wealth and excess. Set amidst the opulent parties and lavish lifestyles of the 1920s, F. Scott Fitzgerald's masterpiece paints a vivid portrait of a society obsessed with materialism and social status. At its core, the novel is a poignant exploration of love, longing, and the disillusionment that often accompanies the pursuit of happiness. Through the enigmatic Jay Gatsby and his unrequited love for Daisy Buchanan, Fitzgerald captures the essence of the Jazz Age and the emptiness that lies beneath its glamorous facade. The prose is elegant and evocative, transporting readers to a bygone era of extravagance and excess. As the narrative unfolds, themes of class disparity, moral decay, and the fleeting nature of success are skillfully woven into the fabric of the story. With its rich symbolism, complex characters, and lyrical prose, The Great Gatsby remains a compelling and thought-provoking work that continues to resonate with readers today.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Classic", "Romance", "Drama"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.postimg.cc/cL09ktnY/2.png",
        "review": "To Kill a Mockingbird is a poignant and thought-provoking novel that tackles sensitive issues such as racial injustice and moral ambiguity. Set in the racially divided town of Maycomb, Alabama, during the 1930s, Harper Lee's masterpiece follows the journey of young Scout Finch as she navigates the complexities of adulthood and witnesses her father, Atticus Finch, defend an innocent black man accused of rape. Through Scout's innocent yet perceptive eyes, readers are confronted with the harsh realities of bigotry, prejudice, and social inequality. Lee's vivid portrayal of the deep-seated racism and injustice prevalent in the Deep South is both haunting and timely, serving as a stark reminder of the enduring legacy of discrimination in America. Despite its somber themes, the novel is infused with moments of warmth, humor, and compassion, thanks to Lee's skillful storytelling and memorable characters. Through Atticus's unwavering integrity and moral courage, To Kill a Mockingbird offers a powerful message of hope and resilience in the face of adversity. With its timeless themes and universal appeal, this Pulitzer Prize-winning novel continues to captivate readers of all ages and backgrounds.",
        "totalPages": 324,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["Classic", "Legal Drama", "Social Issues"],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.postimg.cc/t4crqScd/3.png",
        "review": "1984 is a chilling dystopian novel that explores the dangers of totalitarianism and thought control. Set in a future world where individuality and freedom are suppressed by a totalitarian regime led by the enigmatic Big Brother, George Orwell's masterpiece delves into the consequences of unchecked government power and mass surveillance. Through the eyes of protagonist Winston Smith, readers are plunged into a nightmarish society where independent thought is punished, history is rewritten, and truth is subjective. Orwell's bleak vision of a dystopian future is eerily prophetic, offering a stark warning about the perils of authoritarianism and the erosion of civil liberties. With its haunting themes of oppression, propaganda, and resistance, 1984 remains as relevant today as when it was first published, serving as a poignant reminder of the fragility of democracy and the importance of vigilance in safeguarding individual freedoms.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Dystopian", "Political", "Science Fiction"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.postimg.cc/XJfxgVYx/4.png",
        "review": "Pride and Prejudice is a timeless romance that enchants readers with its delightful characters, sparkling wit, and astute social commentary. Set in the English countryside during the Regency era, Jane Austen's beloved novel follows the spirited Elizabeth Bennet as she navigates the complexities of love, class, and societal expectations. From the memorable first encounter between Elizabeth and the aloof Mr. Darcy to the humorous antics of the matchmaking Mrs. Bennet, Pride and Prejudice brims with memorable moments and unforgettable characters. Austen's keen observations on the nuances of human behavior and the absurdities of polite society add depth and charm to the narrative, making it a perennial favorite among readers of all ages. With its timeless themes of love, pride, and the pursuit of happiness, Pride and Prejudice continues to captivate and inspire generations of readers around the world.",
        "totalPages": 432,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Classic", "Romance", "Regency Era"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.postimg.cc/fLnBX3DJ/5.png",
        "review": "The Catcher in the Rye is a timeless coming-of-age novel that captures the disillusionment and alienation of adolescence. Narrated by the unforgettable protagonist Holden Caulfield, the novel follows his journey through New York City after being expelled from prep school. As Holden grapples with feelings of loneliness, alienation, and cynicism, he encounters a cast of eccentric characters and navigates the complexities of adulthood. J.D. Salinger's masterful portrayal of teenage angst and rebellion resonates with readers of all ages, making The Catcher in the Rye a classic of American literature.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Coming of Age", "Culture", "Literature"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.postimg.cc/dQ94ktXV/6.png",
        "review": "The Hobbit is an enchanting adventure that transports readers to a richly imagined fantasy world. Written by J.R.R. Tolkien, this beloved novel follows the journey of Bilbo Baggins, a hobbit who is reluctantly swept into an epic quest to reclaim a treasure guarded by the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, elves, goblins, and other fantastical creatures, embarking on a quest that will change his life forever. Tolkien's masterful storytelling, rich world-building, and memorable characters make The Hobbit a timeless classic of fantasy literature.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Adventure", "High Fantasy", "Middle-earth"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "https://i.postimg.cc/cL5ssWZD/7.png",
        "review": "The Da Vinci Code is a thrilling mystery that combines art, history, and intrigue into a fast-paced and captivating narrative. Written by Dan Brown, the novel follows Harvard symbologist Robert Langdon as he becomes embroiled in a complex conspiracy surrounding the secrets of the Catholic Church and the works of Leonardo da Vinci. With its intricate puzzles, shocking revelations, and pulse-pounding suspense, The Da Vinci Code keeps readers on the edge of their seats until the very last page.",
        "totalPages": 454,
        "rating": 4.3,
        "category": "Mystery",
        "tags": ["Thriller", "Conspiracy", "Art"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
    },
    {
        "bookId": 8,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "image": "https://i.postimg.cc/Hn2gFDB9/8.png",
        "review": "Harry Potter and the Philosopher's Stone is a captivating tale that transports readers into a world of magic, wonder, and friendship. From the moment Harry discovers he is a wizard and is whisked away to Hogwarts School of Witchcraft and Wizardry, readers are immersed in an enchanting adventure filled with spells, potions, and mythical creatures. J.K. Rowling's vivid storytelling and richly imagined universe captivate audiences of all ages, making this book a timeless classic. The characters are relatable and endearing, each with their own strengths, weaknesses, and complexities. As Harry navigates the challenges of school, friendships, and the mysteries surrounding his own past, readers are drawn into a tale of bravery, loyalty, and the power of love. With its blend of humor, suspense, and heartwarming moments, Harry Potter and the Philosopher's Stone is a must-read for anyone seeking an escape to a world where anything is possible.",
        "totalPages": 332,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Magic", "Adventure", "Young Adult"],
        "publisher": "Bloomsbury Publishing",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 9,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.postimg.cc/MGMzHLpz/9.png",
        "review": "The Alchemist is a philosophical novel that follows the journey of Santiago, a young Andalusian shepherd who dreams of finding a hidden treasure in Egypt. Along his journey, Santiago encounters a series of characters who impart wisdom and guidance, leading him to discover the true meaning of life and pursue his dreams. Written by Brazilian author Paulo Coelho, The Alchemist is a timeless tale of self-discovery, destiny, and the pursuit of one's personal legend.",
        "totalPages": 197,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Philosophical", "Adventure"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    }        
]